//求1 +1/2 +1/3 +1/4 +......+1/100的和
#include <stdio.h>

int main (void)
{
	int i;
	float sum = 0;								//由于1/2为小数，所以sum的值不能用int整型
	for (i=1;i <= 100;++i)						// 1/(++i)不符合语法格式
	{
		sum = sum + 1.0/i;						//sum = sum + (float) (1/i)是不对的  1/i 永远为0，
	}											//或者用sum = sum + 1 / (float)(i)      强制转化
	printf ("sum=%f\n",sum);

	return 0;
}

试数的详细步骤
1 -> i=1    1<=100 成立  sum=sum +1.0/1   ++i      i=2
2 -> i=2     2<=100 成立 sum=sum +1.0/2   ++i      i=3
3 -> i=3     3<=100 成立 sum=sum +1.0/3   ++i      i=4
.................................................................................................
.................................................................................................