//六名嫌疑人，小张，小杜，小马，小王，小李和小赵。侦探费尽心机得到了6条线索。
/*1.小张和小杜至少有一人作案  2.小张、小李和小赵3人中至少2人作案
3.小张和小王不可能是同案犯    4.小杜和小马或者同时作案，或者与本案无关
5.小马和小王有且仅有一人作案  6.如果小王没有作案，那么小李也不可能作案*/

//分别用a,b,c,d,e,f表示小张、小杜、小马、小王、小李、和小赵是否参与作案。参与为1，反之为0.

#include <stdio.h>
int main ()
{
	int a,b,c,d,e,f;
	for (a=0;a<=1;a++)
		for (b=0;b<=1;b++)
			for (c=0;c<=1;c++)
			for (d=0;d<=1;d++)
		for (e=0;e<=1;e++)
	for (f=0;f<=1;f++)
		{
			int b1=((a==1) ||  (b==1));
				int b2=(((a==1)&&(e==1))||((a==1)&&(f==1))||((e==1)&&(f==1)));
					int b3=(!((a==1)&&(d==1)));
					int b4=(((b==1)&&(c==1))||((b==0)&&(c==0)));
				int b5=(((c==1)&&(d==0))||((c==0)&&(d==1)));
			int b6=(((d==0)&&(e==0))||(d==1));
			if (b1&&b2&&b3&&b4&&b5&&b6)
			{
				//输出结果
				if (a==1)printf ("小张参与了作案\n");
				if (b==1)printf ("小杜参与了作案\n");
				if (c==1)printf ("小马参与了作案\n");
				if (d==1)printf ("小王参与了作案\n");
				if (e==1)printf ("小李参与了作案\n");
				if (f==1)printf ("小赵参与了作案\n");

			}
		}
	return 0;
}